rpg.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="sans.css" />
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil

This system is heavily based off the Cypher System by Monte Carlo
games. If these rules sound interesting, I encourage you to go buy
their book!

* Players have might, speed, and intellect points.
These are combined health / mana pools. Physical damage reduces your
might pool, some magical damage can reduce speed or intellect. Most
spells require spending intellect points. Many specialized physical
attacks require spending might or speed.

You can spend pool points to add any roll. At first level, you can
spend up to 3 pool points to add 3 to a single roll. This called using
*effort*.

Each of your pools has an associated *edge*. Edge reduces the cost of
*effort*. An edge of 1 decreases the cost of *effort* by one, an edge
of 2 decreases by 2, and so on.

You are an adjective noun that verbs.

* Choose a noun
** Fighter
- Might 10, Edge 1
- Speed 10, Edge 0
- Intellect 8, Edge 0

And an additional 6 points to distribute as you choose.

You are practiced in all weapons and can use them without penalty.

*Choose* three special abilities:

- *Come and get me*.  Spend 1 int. Roll to convince creature to
  physically attack you next round. They snap out of it at the end of
  their turn. Gets more difficult by one step each attempt.
- *Quick on the draw*. You get +3 to your initiative rolls.
- *Shove*. Spend 1 might to melee attack and move an opponent into a
  position you desire within immediate range. Deals 1 less damage than
  usual.
- *Stab*. Spend 1 might to deal 1 extra damage with a weapon with a sharp point.
- *Daze*. Spend 1 might point to daze an opponent for one round,
  during which time the difficulty of all their actions is increased
  by 3. Deals one less damage than usual.
- *Sharpshooter*. Spend 1 speed to deal 1 extra damage with a ranged
  weapon.
- *Overwatch*. You use a ranged weapon to target a narrow location
  (e.g. a hallway or just above a rock etc.) and attack the first
  creature that appears. This is a trigger action (occurs when someone
  appears). This attack negates any advantage the creature would have
  from cover or surprise (+3 and +6 to difficulty, respectively).
** Traveler
- Might 10, Edge 1
- Speed 9, Edge 0
- Intellect 9, Edge 0

And an additional 6 points to distribute as you choose. If you wield a heavy
weapon, increase the attack difficulty by 3.

*Choose* three special abilities:

- *Danger sense*. The difficulty of your initiative is reduced by 3.
- *Block*. Spend 3 speed points to automatically block the next melee attack against you.
- *Decipher*. Spend 1 intellect point to examine a piece of writing or code you
  do not understand. Make a intellect roll of 3 (or higher, depending on the
  code or language). On success, you get the gist of the message. If used
  in combat, takes an action.
- *Endurance*. Any duration of physical action is halved or doubled. E.g. you can
  march twice as long in a day, or poison wears off twice as fast, or you can
  hold your breathe twice as long. Minimum duration one round.
- *Fleet of foot*. If you succeed a difficulty 6 speed roll to run, you can move
  a short distance and take an action in the same round.
- *Strive*. Spend 2 might points to reduce the difficulty of all non-attack might-based
  rolls by 3. Lasts 10 minutes.
- *Special short*. Reduce damage by 1. Instead, hit in a precise spot
  and e.g. shoot an object out of the creature's hand, unbuckle a bag,
  shoot leg or limb to reduce speed to immediate distance for a few
  days (or until receives medical care).
- You have a Might Edge of 1 and a Speed Edge of 1.
- You are trained in two skills you are not already trained in.
- You can use heavy weapons.
** Seer
- Might 7, Edge 0
- Speed 9, Edge 0
- Intellect 12, Edge 1

*Choose* three special abilities:

- *Truesight vision*. You carry with you a plant offering temporary
  truesight vision. Upon smoking, the plant offers you insight into
  nature of the world around you. This can be the level of a creature,
  or the fact that there is a metal object in a nearby wooden chest,
  etc. After a few moments, the truesight ends and you are left
  mentally befuddled. Costs 2 intellect points.
- *Warding*. You once happened across a plant of warding. You gain 1 Armor
  permanently.
- *Mindkiller*. Spend 1 intellect to deal either 2 intellect damage or 4 physical damage. The
  intellect damage
  action next turn. Agreed upon by the GM prior to rolling.
- *Mind trick*. Spend 1 intellect to convince cognizant creature to do
  a reasonable action next turn. Agreed upon by the GM prior to
  rolling.
- *These are not the droids you're looking for*. Spend 1 intellect
  point to convince an individual that you are not part of a group of
  people. For instance, you are not from a certain town or tribe. The
  effect lasts for 1 hour or until the individual learns of facts
  otherwise. To cast on multiple creatures, 1 additional intellect
  point per creature.
- You are *trained* in intellect defense tasks and have +2 to armor against
  damage that selectively targets intellect (this normally would rely on your
  usual armor).

