rpg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-04 Sun 02:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Evan Bergeron" />
<link rel="stylesheet" type="text/css" href="sans.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org18cf1a8">Players have might, speed, and intellect points.</a></li>
<li><a href="#org47d1bec">Choose a noun</a>
<ul>
<li><a href="#org6516ef0">Fighter</a></li>
<li><a href="#orgae908df">Traveler</a></li>
<li><a href="#org301d1a1">Seer</a></li>
<li><a href="#orgea8bc58">Rogue</a></li>
</ul>
</li>
<li><a href="#orgab510f8">Choose an adjective</a>
<ul>
<li><a href="#org8cf8f15">Charming</a></li>
<li><a href="#orgaa63cce">Driven</a></li>
<li><a href="#org02ce4b4">Exiled</a></li>
<li><a href="#orgc0345b4">Intelligent</a></li>
<li><a href="#org4f9d61d">Maeha</a></li>
<li><a href="#org22480b9">Mysterious</a></li>
<li><a href="#org0e8ee5c">Perceptive</a></li>
<li><a href="#orgb11f960">Rugged</a></li>
<li><a href="#org2daac3c">Sharp</a></li>
<li><a href="#org28f2fa6">Spiritual</a></li>
<li><a href="#org630802d">Stealthy</a></li>
</ul>
</li>
<li><a href="#org6f04dc5">Choose a verb</a>
<ul>
<li><a href="#org788a493">Abides in pumice</a></li>
<li><a href="#org393d518">Carries a quiver</a></li>
<li><a href="#orgb1a5bc1">Fights dirty</a></li>
<li><a href="#org706f54e">Heals</a></li>
<li><a href="#org55ab12f">Hunts with great skill</a></li>
<li><a href="#org3b89832">Lives in the wilderness</a></li>
<li><a href="#orgb94a06b">Murders</a></li>
<li><a href="#org1c749ff">Wields a fire spear</a></li>
<li><a href="#org37b7f3b">Wields two weapons at once</a></li>
</ul>
</li>
<li><a href="#orga91b60c">Games mechanics</a>
<ul>
<li><a href="#org3269b1d">Players make all the rolls.</a></li>
<li><a href="#orgefa82aa">Attacking and defending</a></li>
<li><a href="#org9597707">Players get an action per turn.</a></li>
<li><a href="#org0cce6ca">Players have three pools of points.</a></li>
<li><a href="#orgb74f9d6">Players spend pool points to reduce difficulties.</a></li>
<li><a href="#orgce316e9">Edge reduces the cost of effort.</a></li>
<li><a href="#orgb3f52c9">Resting restores 1d6 pool points.</a></li>
<li><a href="#org14eb351">Training situationally reduces difficulty.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This system is heavily based off the Cypher System by Monte Carlo
games. If these rules sound interesting, I encourage you to go buy
their book!
</p>

<div id="outline-container-org18cf1a8" class="outline-2">
<h2 id="org18cf1a8">Players have might, speed, and intellect points.</h2>
<div class="outline-text-2" id="text-org18cf1a8">
<p>
These are combined health / mana pools. Physical damage reduces your
might pool, some magical damage can reduce speed or intellect. Most
spells require spending intellect points. Many specialized physical
attacks require spending might or speed.
</p>

<p>
You can spend pool points to add any roll. At first level, you can
spend up to 3 pool points to add 3 to a single roll. This called using
<b>effort</b>.
</p>

<p>
Each of your pools has an associated <b>edge</b>. Edge reduces the cost of
<b>effort</b>. An edge of 1 decreases the cost of <b>effort</b> by one, an edge
of 2 decreases by 2, and so on.
</p>

<p>
You are an adjective noun that verbs.
</p>
</div>
</div>

<div id="outline-container-org47d1bec" class="outline-2">
<h2 id="org47d1bec">Choose a noun</h2>
<div class="outline-text-2" id="text-org47d1bec">
</div>
<div id="outline-container-org6516ef0" class="outline-3">
<h3 id="org6516ef0">Fighter</h3>
<div class="outline-text-3" id="text-org6516ef0">
<ul class="org-ul">
<li>Might 10, Edge 1</li>
<li>Speed 10, Edge 0</li>
<li>Intellect 8, Edge 0</li>
</ul>

<p>
And an additional 6 points to distribute as you choose.
</p>

<p>
You are practiced in all weapons and can use them without penalty.
</p>

<p>
<b>Choose</b> three special abilities:
</p>

<ul class="org-ul">
<li><b>Come and get me</b>.  Spend 1 int. Roll to convince creature to
physically attack you next round. They snap out of it at the end of
their turn. Gets more difficult by one step each attempt.</li>
<li><b>Quick on the draw</b>. You get +3 to your initiative rolls.</li>
<li><b>Shove</b>. Spend 1 might to melee attack and move an opponent into a
position you desire within immediate range. Deals 1 less damage than
usual.</li>
<li><b>Stab</b>. Spend 1 might to deal 1 extra damage with a weapon with a sharp point.</li>
<li><b>Daze</b>. Spend 1 might point to daze an opponent for one round,
during which time the difficulty of all their actions is increased
by 3. Deals one less damage than usual.</li>
<li><b>Sharpshooter</b>. Spend 1 speed to deal 1 extra damage with a ranged
weapon.</li>
<li><b>Overwatch</b>. You use a ranged weapon to target a narrow location
(e.g. a hallway or just above a rock etc.) and attack the first
creature that appears. This is a trigger action (occurs when someone
appears). This attack negates any advantage the creature would have
from cover or surprise (+3 and +6 to difficulty, respectively).</li>
</ul>
</div>
</div>
<div id="outline-container-orgae908df" class="outline-3">
<h3 id="orgae908df">Traveler</h3>
<div class="outline-text-3" id="text-orgae908df">
<ul class="org-ul">
<li>Might 10, Edge 1</li>
<li>Speed 9, Edge 0</li>
<li>Intellect 9, Edge 0</li>
</ul>

<p>
And an additional 6 points to distribute as you choose. If you wield a heavy
weapon, increase the attack difficulty by 3.
</p>

<p>
<b>Choose</b> three special abilities:
</p>

<ul class="org-ul">
<li><b>Danger sense</b>. The difficulty of your initiative is reduced by 3.</li>
<li><b>Block</b>. Spend 3 speed points to automatically block the next melee attack against you.</li>
<li><b>Decipher</b>. Spend 1 intellect point to examine a piece of writing or code you
do not understand. Make a intellect roll of 3 (or higher, depending on the
code or language). On success, you get the gist of the message. If used
in combat, takes an action.</li>
<li><b>Endurance</b>. Any duration of physical action is halved or doubled. E.g. you can
march twice as long in a day, or poison wears off twice as fast, or you can
hold your breathe twice as long. Minimum duration one round.</li>
<li><b>Fleet of foot</b>. If you succeed a difficulty 6 speed roll to run, you can move
a short distance and take an action in the same round.</li>
<li><b>Strive</b>. Spend 2 might points to reduce the difficulty of all non-attack might-based
rolls by 3. Lasts 10 minutes.</li>
<li><b>Special short</b>. Reduce damage by 1. Instead, hit in a precise spot
and e.g. shoot an object out of the creature's hand, unbuckle a bag,
shoot leg or limb to reduce speed to immediate distance for a few
days (or until receives medical care).</li>
<li>You have a Might Edge of 1 and a Speed Edge of 1.</li>
<li>You are trained in two skills you are not already trained in.</li>
<li>You can use heavy weapons.</li>
</ul>
</div>
</div>
<div id="outline-container-org301d1a1" class="outline-3">
<h3 id="org301d1a1">Seer</h3>
<div class="outline-text-3" id="text-org301d1a1">
<ul class="org-ul">
<li>Might 7, Edge 0</li>
<li>Speed 9, Edge 0</li>
<li>Intellect 12, Edge 1</li>
</ul>

<p>
<b>Choose</b> three special abilities:
</p>

<ul class="org-ul">
<li><b>Truesight vision</b>. You carry with you a plant offering temporary
truesight vision. Upon smoking, the plant offers you insight into
nature of the world around you. This can be the level of a creature,
or the fact that there is a metal object in a nearby wooden chest,
etc. After a few moments, the truesight ends and you are left
mentally befuddled. Costs 2 intellect points.</li>
<li><b>Warding</b>. You once happened across a plant of warding. You gain 1 Armor
permanently.</li>
<li><b>Mindkiller</b>. Spend 1 intellect to deal either 2 intellect damage or 4 physical damage. The
intellect damage
action next turn. Agreed upon by the GM prior to rolling.</li>
<li><b>Mind trick</b>. Spend 1 intellect to convince cognizant creature to do
a reasonable action next turn. Agreed upon by the GM prior to
rolling.</li>
<li><b>These are not the droids you're looking for</b>. Spend 1 intellect
point to convince an individual that you are not part of a group of
people. For instance, you are not from a certain town or tribe. The
effect lasts for 1 hour or until the individual learns of facts
otherwise. To cast on multiple creatures, 1 additional intellect
point per creature.</li>
<li>You are <b>trained</b> in intellect defense tasks and have +2 to armor against
damage that selectively targets intellect (this normally would rely on your
usual armor).</li>
</ul>
</div>
</div>
