rpg.org
** Rogue
- Might 10, Edge 1
- Speed 9, Edge 0
- Intellect 9, Edge 0

And an additional 6 points to distribute as you choose. If you wield a heavy
weapon, increase the attack difficulty by three.

*Choose* three special abilities:

- *Danger sense*. The difficulty of your initiative is reduced by 3.
- *Block*. Spend 3 speed points to automatically block the next melee attack against you.
- *Decipher*. Spend 1 intellect point to examine a piece of writing or code you
  do not understand. Make a intellect roll of 3 (or higher, depending on the
  code or language). On success, you get the gist of the message. If used
  in combat, takes an action.
- *Endurance*. Any duration of physical action is halved or doubled. E.g. you can
  march twice as long in a day, or poison wears off twice as fast, or you can
  hold your breathe twice as long. Minimum duration one round.
- You have a Might Edge of 1 and a Speed Edge of 1.
- *Fleet of foot*. If you succeed a difficulty 6 speed roll to run, you can move
  a short distance and take an action in the same round.
- *Goad*. After you successfully attack a creature, the difficulty of
  all others speed defense against the creature's attacks decreased by
  three until the next round.
- *Nightstrike*. When you attack in dim light or darkness, you get a
  free level of effort on the attack.
- *Sleight of hand*. 1 speed point. You can e.g. move a object from
  your hand to a desired spot (e.g. your pocket). You can make someone
  believe they have something in their possession that they do not
  have (or vice versa). You can switch objects right in front of
  someone's eyes. Action.
- *Opportunist*. You have an asset on any attack roll you make on a
  creature that has already been attacked this round and is within immediate range.
- You are trained in two skills you are not already trained in.

* Choose an adjective
** Charming
+2 Intellect. *Trained* in pleasant social interaction and special
abilities that influence the minds of others. You not much of a
bookworm and so *struggle* in lore, knowledge, or understanding and
resisting mental attacks.

** Driven
+2 Might. Trained in intellect defense. Each day you are *trained* in
a skill of your choice that you believe will help you reach your
goal. You are so focused on your mission, you don't notice other
things and *struggle* on all perception tasks.

When you choose this descriptor, choose a mission you want to
accomplish. You probably talk about it a lot. When you accomplish the
mission, choose another.

** Exiled
+2 might. As a loner, you gain no benefit when someone with training
helps you with a task. You're *trained* in sneaking, foraging,
hunting, and finding safe places. Your extended solitary time causes
you to *struggle* in social situation.

Perhaps you committed a horrible deed or carry some token from an
earlier, cheerier time in your life.

** Intelligent
+2 intellect. *Trained* in area of knowledge of your choice and all
tasks that draw from your memory.
  
** Maeha
+2 might. You are half human, half bison. You are *trained* in
foraging, nature-based history, smell-based perception checks, and a
sense of direction in the open plains. You *struggle* with
vision-based perception checks. Your permanent horns are a medium
weapon.

** Mysterious
Trained in stealth and resisting interrogation. Once per recovery
period, you can attempt any action as if you were trained in it. You
*struggle* in getting people to believe or trust you.

** Perceptive
+2 intellect. *Trained* in finding or noticing small
details, identifying objects, recalling trivia, and intimidating
another creature. You *struggle* in positive social interaction.

** Rugged
*Trained* in climbing, jumping, running, swimming. *Trained* in
training, riding, or placating natural animals. Trained in
identifying or using natural plants. You struggle with charm,
persuasion, etiquette and deception.

** Sharp
Trained in initiative and perception. If an opponent has a
straightforward weakness, the GM will tell you.

** Spiritual
+2 intellect. Trained in pleasant social interaction,
intellect defense tasks, and resisting temptation. When you help
someone, they add 1 to their roll. You hesistate when taking in
novel details, and so *struggle* with initiative actions.

** Stealthy
+2 speed. Trained in stealth, lying, and trickery and all such special
abilities. You're stealthy but not fast and so struggle with
movement-related tasks.

* Choose a verb
** Abides in pumice
You are a creature of pumice, not flesh. You can move, speak, and feel
pain. Your pumice body makes it harder to take damage, but also harder
to heal. You typically do not wear clothes, though your stone frame
may be carved as such.

Minor effect suggestion: you step on the target and prevent it from
moving next turn.  Major effect suggestion: you break a weapon,
shield, or piece of armor the target is using.

You gain +1 to armor, +1 might edge, and 5 additional might
points. You do not need to eat or drink or breathe (though you still
need to rest and sleep). You move more stiffly than a creature of
flesh, so can never be trained in speed defense rolls. You are
practiced as using your stone fists as a medium weapon.

You are unable to use the first, single-action recovery roll of the
day. Thus, the first recovery roll uses ten minutes, the second uses
an hour, and the last requires ten hours.
** Carries a quiver
Minor effect suggestion: hit in a tendon or muscle, the target takes 2
points of speed damage as well as normal damage. Major effect
suggestion: the target is pinned in place with an arrow.

You can spend points from either speed or intellect when applying
levels of effort to increase bow damage.
** Fights dirty
Minor effect suggestion: You make the foe trip and fall prone. Major
effect suggestion: You tangle something around you foe's leg and they
lose their next turn.

When your foe is disadvantaged in any way, the difficulty of attack is
decreased by three.

You are trained in deception.
** Heals
Minor effect suggestion: the target is healed for 1 extra point. Major
effect suggestion: the target is healed for 2 extra points.

1 intellect point. With a touch, you restore 1d6 points to any stat
pool of a creature. Difficulty 6 intellect task. Each time you use
this on a creature, the difficulty increases by three. Difficulty
returns to 6 after the creature takes a long rest.
