rpg.html

<div id="outline-container-orgea8bc58" class="outline-3">
<h3 id="orgea8bc58">Rogue</h3>
<div class="outline-text-3" id="text-orgea8bc58">
<ul class="org-ul">
<li>Might 10, Edge 1</li>
<li>Speed 9, Edge 0</li>
<li>Intellect 9, Edge 0</li>
</ul>

<p>
And an additional 6 points to distribute as you choose. If you wield a heavy
weapon, increase the attack difficulty by three.
</p>

<p>
<b>Choose</b> three special abilities:
</p>

<ul class="org-ul">
<li><b>Danger sense</b>. The difficulty of your initiative is reduced by 3.</li>
<li><b>Block</b>. Spend 3 speed points to automatically block the next melee attack against you.</li>
<li><b>Decipher</b>. Spend 1 intellect point to examine a piece of writing or code you
do not understand. Make a intellect roll of 3 (or higher, depending on the
code or language). On success, you get the gist of the message. If used
in combat, takes an action.</li>
<li><b>Endurance</b>. Any duration of physical action is halved or doubled. E.g. you can
march twice as long in a day, or poison wears off twice as fast, or you can
hold your breathe twice as long. Minimum duration one round.</li>
<li>You have a Might Edge of 1 and a Speed Edge of 1.</li>
<li><b>Fleet of foot</b>. If you succeed a difficulty 6 speed roll to run, you can move
a short distance and take an action in the same round.</li>
<li><b>Goad</b>. After you successfully attack a creature, the difficulty of
all others speed defense against the creature's attacks decreased by
three until the next round.</li>
<li><b>Nightstrike</b>. When you attack in dim light or darkness, you get a
free level of effort on the attack.</li>
<li><b>Sleight of hand</b>. 1 speed point. You can e.g. move a object from
your hand to a desired spot (e.g. your pocket). You can make someone
believe they have something in their possession that they do not
have (or vice versa). You can switch objects right in front of
someone's eyes. Action.</li>
<li><b>Opportunist</b>. You have an asset on any attack roll you make on a
creature that has already been attacked this round and is within immediate range.</li>
<li>You are trained in two skills you are not already trained in.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgab510f8" class="outline-2">
<h2 id="orgab510f8">Choose an adjective</h2>
<div class="outline-text-2" id="text-orgab510f8">
</div>
<div id="outline-container-org8cf8f15" class="outline-3">
<h3 id="org8cf8f15">Charming</h3>
<div class="outline-text-3" id="text-org8cf8f15">
<p>
+2 Intellect. <b>Trained</b> in pleasant social interaction and special
abilities that influence the minds of others. You not much of a
bookworm and so <b>struggle</b> in lore, knowledge, or understanding and
resisting mental attacks.
</p>
</div>
</div>

<div id="outline-container-orgaa63cce" class="outline-3">
<h3 id="orgaa63cce">Driven</h3>
<div class="outline-text-3" id="text-orgaa63cce">
<p>
+2 Might. Trained in intellect defense. Each day you are <b>trained</b> in
a skill of your choice that you believe will help you reach your
goal. You are so focused on your mission, you don't notice other
things and <b>struggle</b> on all perception tasks.
</p>

<p>
When you choose this descriptor, choose a mission you want to
accomplish. You probably talk about it a lot. When you accomplish the
mission, choose another.
</p>
</div>
</div>

<div id="outline-container-org02ce4b4" class="outline-3">
<h3 id="org02ce4b4">Exiled</h3>
<div class="outline-text-3" id="text-org02ce4b4">
<p>
+2 might. As a loner, you gain no benefit when someone with training
helps you with a task. You're <b>trained</b> in sneaking, foraging,
hunting, and finding safe places. Your extended solitary time causes
you to <b>struggle</b> in social situation.
</p>

<p>
Perhaps you committed a horrible deed or carry some token from an
earlier, cheerier time in your life.
</p>
</div>
</div>

<div id="outline-container-orgc0345b4" class="outline-3">
<h3 id="orgc0345b4">Intelligent</h3>
<div class="outline-text-3" id="text-orgc0345b4">
<p>
+2 intellect. <b>Trained</b> in area of knowledge of your choice and all
tasks that draw from your memory.
</p>
</div>
</div>

<div id="outline-container-org4f9d61d" class="outline-3">
<h3 id="org4f9d61d">Maeha</h3>
<div class="outline-text-3" id="text-org4f9d61d">
<p>
+2 might. You are half human, half bison. You are <b>trained</b> in
foraging, nature-based history, smell-based perception checks, and a
sense of direction in the open plains. You <b>struggle</b> with
vision-based perception checks. Your permanent horns are a medium
weapon.
</p>
</div>
</div>

<div id="outline-container-org22480b9" class="outline-3">
<h3 id="org22480b9">Mysterious</h3>
<div class="outline-text-3" id="text-org22480b9">
<p>
Trained in stealth and resisting interrogation. Once per recovery
period, you can attempt any action as if you were trained in it. You
<b>struggle</b> in getting people to believe or trust you.
</p>
</div>
</div>

<div id="outline-container-org0e8ee5c" class="outline-3">
<h3 id="org0e8ee5c">Perceptive</h3>
<div class="outline-text-3" id="text-org0e8ee5c">
<p>
+2 intellect. <b>Trained</b> in finding or noticing small
details, identifying objects, recalling trivia, and intimidating
another creature. You <b>struggle</b> in positive social interaction.
</p>
</div>
</div>

<div id="outline-container-orgb11f960" class="outline-3">
<h3 id="orgb11f960">Rugged</h3>
<div class="outline-text-3" id="text-orgb11f960">
<p>
<b>Trained</b> in climbing, jumping, running, swimming. <b>Trained</b> in
training, riding, or placating natural animals. Trained in
identifying or using natural plants. You struggle with charm,
persuasion, etiquette and deception.
</p>
</div>
</div>

<div id="outline-container-org2daac3c" class="outline-3">
<h3 id="org2daac3c">Sharp</h3>
<div class="outline-text-3" id="text-org2daac3c">
<p>
Trained in initiative and perception. If an opponent has a
straightforward weakness, the GM will tell you.
</p>
</div>
</div>

<div id="outline-container-org28f2fa6" class="outline-3">
<h3 id="org28f2fa6">Spiritual</h3>
<div class="outline-text-3" id="text-org28f2fa6">
<p>
+2 intellect. Trained in pleasant social interaction,
intellect defense tasks, and resisting temptation. When you help
someone, they add 1 to their roll. You hesistate when taking in
novel details, and so <b>struggle</b> with initiative actions.
</p>
</div>
</div>

<div id="outline-container-org630802d" class="outline-3">
<h3 id="org630802d">Stealthy</h3>
<div class="outline-text-3" id="text-org630802d">
<p>
+2 speed. Trained in stealth, lying, and trickery and all such special
abilities. You're stealthy but not fast and so struggle with
movement-related tasks.
</p>
</div>
</div>
</div>

<div id="outline-container-org6f04dc5" class="outline-2">
<h2 id="org6f04dc5">Choose a verb</h2>
<div class="outline-text-2" id="text-org6f04dc5">
</div>
<div id="outline-container-org788a493" class="outline-3">
<h3 id="org788a493">Abides in pumice</h3>
<div class="outline-text-3" id="text-org788a493">
<p>
You are a creature of pumice, not flesh. You can move, speak, and feel
pain. Your pumice body makes it harder to take damage, but also harder
to heal. You typically do not wear clothes, though your stone frame
may be carved as such.
</p>

<p>
Minor effect suggestion: you step on the target and prevent it from
moving next turn.  Major effect suggestion: you break a weapon,
shield, or piece of armor the target is using.
</p>

<p>
You gain +1 to armor, +1 might edge, and 5 additional might
points. You do not need to eat or drink or breathe (though you still
need to rest and sleep). You move more stiffly than a creature of
flesh, so can never be trained in speed defense rolls. You are
practiced as using your stone fists as a medium weapon.
</p>

<p>
You are unable to use the first, single-action recovery roll of the
day. Thus, the first recovery roll uses ten minutes, the second uses
an hour, and the last requires ten hours.
</p>
</div>
</div>
<div id="outline-container-org393d518" class="outline-3">
<h3 id="org393d518">Carries a quiver</h3>
<div class="outline-text-3" id="text-org393d518">
<p>
Minor effect suggestion: hit in a tendon or muscle, the target takes 2
points of speed damage as well as normal damage. Major effect
suggestion: the target is pinned in place with an arrow.
</p>

<p>
You can spend points from either speed or intellect when applying
levels of effort to increase bow damage.
</p>
</div>
</div>
<div id="outline-container-orgb1a5bc1" class="outline-3">
<h3 id="orgb1a5bc1">Fights dirty</h3>
<div class="outline-text-3" id="text-orgb1a5bc1">
<p>
Minor effect suggestion: You make the foe trip and fall prone. Major
effect suggestion: You tangle something around you foe's leg and they
lose their next turn.
</p>

<p>
When your foe is disadvantaged in any way, the difficulty of attack is
decreased by three.
</p>

<p>
You are trained in deception.
</p>
</div>
</div>
<div id="outline-container-org706f54e" class="outline-3">
<h3 id="org706f54e">Heals</h3>
<div class="outline-text-3" id="text-org706f54e">
<p>
Minor effect suggestion: the target is healed for 1 extra point. Major
effect suggestion: the target is healed for 2 extra points.
</p>

<p>
1 intellect point. With a touch, you restore 1d6 points to any stat
pool of a creature. Difficulty 6 intellect task. Each time you use
this on a creature, the difficulty increases by three. Difficulty
returns to 6 after the creature takes a long rest.
</p>
</div>
</div>
