rpg.org
** Hunts with great skill
Minor effect suggestion: You can attempt an intimidating task to cause
your foe to immediately surrender.  Major effect suggestion: Your foe
pauses, terrified, and takes no action on their turn.

You are trained in following and identifying tracks. You are trained
in all types of movement (climbing, swimming, jumping, balancing).

** Lives in the wilderness
Minor effect suggestion: A natural creature foe flees. Major effect
suggestion: A natural creature foe becomes warily passive.

Trained in climbing, swimming, wilderness navigation, and identifying
plants and creatures.

** Murders
Minor effect suggestion: no one but the foe notices your attack.
Major effect suggestion: if you have poison, you apply it just before
the strike, adding poison's effects to the normal damange.

If you attack with surprise or before an opponent has acted, the
difficulty of your attack is reduced by three. On a successful
surprise attack, you inflict 2 more points of damange.

You are trained in stealth and disguise.
** Wields a fire spear
TODO
** Wields two weapons at once
Minor effect suggestion: Target is intimidated and flees at its next
action. Major effect suggestion: You can make an additional attack
with one of your weapons.

You can wield two light weapons at the same time, making two separate
attacks with a single action. At first level, you can apply effort to
only one of these attacks. Armor applies to both damages.

* Games mechanics
** Players make all the rolls.

Every roll has a difficulty, as determined by the GM. The player must
roll that difficulty or higher to succeed. Rolls typically have bonuses
applied to them.

Some examples of things that reduce difficulty include knowledge of a
situation, quality weapons or armor, training, an advantageous
situation, etc.

Players can spend pool points to lower difficulties.

Rolling a natural 19 or 20 (assuming the roll is a success against the
TD) introduces a *minor* or *major effect*, respectively.

Minor effects could be a particular grace to your action, or in
combat, an extra 3 damage, the opponent knocking the foe back,
distracting the foe, etc..

Major effects could be an extra 4 damage, knocking your foe down,
stunning them, etc. Alternatively, in combat, you may take another
action.

The verb you choose gives you some more minor and major effects.

** Attacking and defending

Attacking an opponent is a roll, defending an attack is a
roll. The difficulty of these rolls is equal to the level of the opponent. For
instance, to hit or defend against a level 2 opponent requires a 6 or higher.

Damage and armor are flat numbers.

- *Light weapons* deal 2 damage and reduce TD by 1, as they're quick and easy to use.
- *Medium weapons* deal 4 damage.
- *Heavy weapons* require two hands and deal 6 damage.

Rolling a 17 deals an extra point of damage.
Rolling high can deal more damage.

- 17 deals 1 additional damage.
- 18 deals 2 additional damage.
- 19 deals 3 additional damage or introduces a minor effect.
- 20 deals 4 additional damage or introduces a major effect.

Armor reduces damage by a flat amount, possibly down to zero.

Roll a 1 is bad as well and may introduce a GM complication. I'm not too
familiar on the rules of GM complications now, so we'll keep it simple and
forgiving for now :)

Distance is either *immediate*, *short* (15-50"), or *long*.

** Players get an action per turn.

Example actions include moving to melee attack an opponent in immediate range,
making a ranged attack, performing a short plant ritual, or moving a short
distance.

** Players have three pools of points.

- Might
- Speed
- Intellect

Each pool has an associated modifier called *edge*.

Damage is dealt against one of these pools. Physical attacks against
might. Perhaps a drug inducing clusminess may deal against speed. Some
mystic may attack against intellect.

** Players spend pool points to reduce difficulties.

** Edge reduces the cost of effort.

When spending pool points as effort, subtract the associated edge
modifier from the number of pool points spent.

** Resting restores 1d6 pool points.

These can be distributed amongst the pools as you wish.

The first rest of the day takes an action (e.g. instead of attacking
in combat). The second rest of the day takes 10 minutes. Third takes
an hour. Fourth is 10 hours. So per day, you can gain 4d6 points back.

** Training situationally reduces difficulty.

Being trained in a skill is a plus three bonus. Being specialized is a
plus 6.
