rpg.html
<div id="outline-container-org55ab12f" class="outline-3">
<h3 id="org55ab12f">Hunts with great skill</h3>
<div class="outline-text-3" id="text-org55ab12f">
<p>
Minor effect suggestion: You can attempt an intimidating task to cause
your foe to immediately surrender.  Major effect suggestion: Your foe
pauses, terrified, and takes no action on their turn.
</p>

<p>
You are trained in following and identifying tracks. You are trained
in all types of movement (climbing, swimming, jumping, balancing).
</p>
</div>
</div>

<div id="outline-container-org3b89832" class="outline-3">
<h3 id="org3b89832">Lives in the wilderness</h3>
<div class="outline-text-3" id="text-org3b89832">
<p>
Minor effect suggestion: A natural creature foe flees. Major effect
suggestion: A natural creature foe becomes warily passive.
</p>

<p>
Trained in climbing, swimming, wilderness navigation, and identifying
plants and creatures.
</p>
</div>
</div>

<div id="outline-container-orgb94a06b" class="outline-3">
<h3 id="orgb94a06b">Murders</h3>
<div class="outline-text-3" id="text-orgb94a06b">
<p>
Minor effect suggestion: no one but the foe notices your attack.
Major effect suggestion: if you have poison, you apply it just before
the strike, adding poison's effects to the normal damange.
</p>

<p>
If you attack with surprise or before an opponent has acted, the
difficulty of your attack is reduced by three. On a successful
surprise attack, you inflict 2 more points of damange.
</p>

<p>
You are trained in stealth and disguise.
</p>
</div>
</div>
<div id="outline-container-org1c749ff" class="outline-3">
<h3 id="org1c749ff">Wields a fire spear</h3>
<div class="outline-text-3" id="text-org1c749ff">
<p>
TODO
</p>
</div>
</div>
<div id="outline-container-org37b7f3b" class="outline-3">
<h3 id="org37b7f3b">Wields two weapons at once</h3>
<div class="outline-text-3" id="text-org37b7f3b">
<p>
Minor effect suggestion: Target is intimidated and flees at its next
action. Major effect suggestion: You can make an additional attack
with one of your weapons.
</p>

<p>
You can wield two light weapons at the same time, making two separate
attacks with a single action. At first level, you can apply effort to
only one of these attacks. Armor applies to both damages.
</p>
</div>
</div>
</div>

<div id="outline-container-orga91b60c" class="outline-2">
<h2 id="orga91b60c">Games mechanics</h2>
<div class="outline-text-2" id="text-orga91b60c">
</div>
<div id="outline-container-org3269b1d" class="outline-3">
<h3 id="org3269b1d">Players make all the rolls.</h3>
<div class="outline-text-3" id="text-org3269b1d">
<p>
Every roll has a difficulty, as determined by the GM. The player must
roll that difficulty or higher to succeed. Rolls typically have bonuses
applied to them.
</p>

<p>
Some examples of things that reduce difficulty include knowledge of a
situation, quality weapons or armor, training, an advantageous
situation, etc.
</p>

<p>
Players can spend pool points to lower difficulties.
</p>

<p>
Rolling a natural 19 or 20 (assuming the roll is a success against the
TD) introduces a <b>minor</b> or <b>major effect</b>, respectively.
</p>

<p>
Minor effects could be a particular grace to your action, or in
combat, an extra 3 damage, the opponent knocking the foe back,
distracting the foe, etc..
</p>

<p>
Major effects could be an extra 4 damage, knocking your foe down,
stunning them, etc. Alternatively, in combat, you may take another
action.
</p>

<p>
The verb you choose gives you some more minor and major effects.
</p>
</div>
</div>

<div id="outline-container-orgefa82aa" class="outline-3">
<h3 id="orgefa82aa">Attacking and defending</h3>
<div class="outline-text-3" id="text-orgefa82aa">
<p>
Attacking an opponent is a roll, defending an attack is a
roll. The difficulty of these rolls is equal to the level of the opponent. For
instance, to hit or defend against a level 2 opponent requires a 6 or higher.
</p>

<p>
Damage and armor are flat numbers.
</p>

<ul class="org-ul">
<li><b>Light weapons</b> deal 2 damage and reduce TD by 1, as they're quick and easy to use.</li>
<li><b>Medium weapons</b> deal 4 damage.</li>
<li><b>Heavy weapons</b> require two hands and deal 6 damage.</li>
</ul>

<p>
Rolling a 17 deals an extra point of damage.
Rolling high can deal more damage.
</p>

<ul class="org-ul">
<li>17 deals 1 additional damage.</li>
<li>18 deals 2 additional damage.</li>
<li>19 deals 3 additional damage or introduces a minor effect.</li>
<li>20 deals 4 additional damage or introduces a major effect.</li>
</ul>

<p>
Armor reduces damage by a flat amount, possibly down to zero.
</p>

<p>
Roll a 1 is bad as well and may introduce a GM complication. I'm not too
familiar on the rules of GM complications now, so we'll keep it simple and
forgiving for now :)
</p>

<p>
Distance is either <b>immediate</b>, <b>short</b> (15-50"), or <b>long</b>.
</p>
</div>
</div>

<div id="outline-container-org9597707" class="outline-3">
<h3 id="org9597707">Players get an action per turn.</h3>
<div class="outline-text-3" id="text-org9597707">
<p>
Example actions include moving to melee attack an opponent in immediate range,
making a ranged attack, performing a short plant ritual, or moving a short
distance.
</p>
</div>
</div>

<div id="outline-container-org0cce6ca" class="outline-3">
<h3 id="org0cce6ca">Players have three pools of points.</h3>
<div class="outline-text-3" id="text-org0cce6ca">
<ul class="org-ul">
<li>Might</li>
<li>Speed</li>
<li>Intellect</li>
</ul>

<p>
Each pool has an associated modifier called <b>edge</b>.
</p>

<p>
Damage is dealt against one of these pools. Physical attacks against
might. Perhaps a drug inducing clusminess may deal against speed. Some
mystic may attack against intellect.
</p>
</div>
</div>

<div id="outline-container-orgb74f9d6" class="outline-3">
<h3 id="orgb74f9d6">Players spend pool points to reduce difficulties.</h3>
</div>

<div id="outline-container-orgce316e9" class="outline-3">
<h3 id="orgce316e9">Edge reduces the cost of effort.</h3>
<div class="outline-text-3" id="text-orgce316e9">
<p>
When spending pool points as effort, subtract the associated edge
modifier from the number of pool points spent.
</p>
</div>
</div>

<div id="outline-container-orgb3f52c9" class="outline-3">
<h3 id="orgb3f52c9">Resting restores 1d6 pool points.</h3>
<div class="outline-text-3" id="text-orgb3f52c9">
<p>
These can be distributed amongst the pools as you wish.
</p>

<p>
The first rest of the day takes an action (e.g. instead of attacking
in combat). The second rest of the day takes 10 minutes. Third takes
an hour. Fourth is 10 hours. So per day, you can gain 4d6 points back.
</p>
</div>
</div>

<div id="outline-container-org14eb351" class="outline-3">
<h3 id="org14eb351">Training situationally reduces difficulty.</h3>
<div class="outline-text-3" id="text-org14eb351">
<p>
Being trained in a skill is a plus three bonus. Being specialized is a
plus 6.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
